toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
// MARK: - Power

static void _VDDIMGSDEnabledChanged() {
    if (_VDDIMGSDEnabled::Asserted()) {
        _Pin::VDD_B_2V8_IMG_SD_EN::Write(1);
        _Scheduler::Sleep(_Scheduler::Us<100>); // 100us delay needed between power on of VAA (2V8) and VDD_IO (1V8)
        _Pin::VDD_B_1V8_IMG_SD_EN::Write(1);
        
        // Rails take ~1ms to turn on, so wait 2ms to be sure
        _Scheduler::Sleep(_Scheduler::Ms<2>);
    
    } else {
        // No delay between 2V8/1V8 needed for power down (per AR0330CS datasheet)
        _Pin::VDD_B_2V8_IMG_SD_EN::Write(0);
        _Pin::VDD_B_1V8_IMG_SD_EN::Write(0);
        
        // Rails take ~1.5ms to turn off, so wait 2ms to be sure
        _Scheduler::Sleep(_Scheduler::Ms<2>);
    }
}

// MARK: - ICE40

template<>
void _ICE::Transfer(const Msg& msg, Resp* resp) {
    AssertArg((bool)resp == (bool)(msg.type & _ICE::MsgType::Resp));
    _SPI::WriteRead(msg, resp);
}

static void _ICEInit() {
    bool ok = false;
    for (int i=0; i<100 && !ok; i++) {
        _Scheduler::Sleep(_Scheduler::Ms<1>);
        // Reset ICE comms (by asserting SPI CLK for some length of time)
        _SPI::ICEReset();
        // Init ICE comms
        ok = _ICE::Init();
    }
    Assert(ok);
}





// MARK: - _TaskBatteryLevel

struct _TaskBatteryLevel {
    static void Run() {
        // Init BatterySampler
        _BatterySampler::Init();
        
        for (;;) {
            // Wait until something triggers us to update
            _Scheduler::Wait([] { return _Update; });
            
            // Update our battery level
            _BatteryLevel = _BatterySampler::Sample();
            
            // Update our state
            _Update = false;
        }
    }
    
    static MSP::BatteryLevel Get() {
        return _BatteryLevel;
    }
    
    static void Update() {
        _Update = true;
    }
    
    static void Wait() {
        _Scheduler::Wait([] { return !_Update; });
    }
    
    static inline MSP::BatteryLevel _BatteryLevel = MSP::BatteryLevelInvalid;
    static inline bool _Update = false;
    
    // Task stack
    SchedulerStack(".stack._TaskBatteryLevel")
    static inline uint8_t Stack[128];
};










// MARK: - _TaskPower

#define _TaskPowerStackSize 128

SchedulerStack(".stack._TaskPower")
uint8_t _TaskPowerStack[_TaskPowerStackSize];

asm(".global _StartupStack");
asm(".equ _StartupStack, _TaskPowerStack+" Stringify(_TaskPowerStackSize));

struct _TaskPower {
    static void Run() {
        // Disable interrupts because _Init() and _Wired require it
        Toastbox::IntState ints(false);
        
        _Init();
        
        for (;;) {
            switch (_State) {
            case __State::Off:
                _Scheduler::Wait([] { return _BatteryTrapEnter() || _ButtonHold; });
                if (_BatteryTrapEnter()) {
                    _State = __State::OffBatteryTrap;
                } else {
                    _State = __State::On;
                    _ButtonHold = false;
                }
                break;
            
            case __State::OffBatteryTrap:
                _Scheduler::Wait([] { return _Wired::Wired() || _ButtonHold; });
                if (_Wired::Wired()) {
                    _State = __State::OnBatteryTrap;
                } else {
//                    BlinkRedLED();
                    _ButtonHold = false;
                }
                break;
            
            case __State::On:
                _Scheduler::Wait([] { return _BatteryTrapEnter() || _ButtonHold; });
                if (_BatteryTrapEnter()) {
                    _State = __State::OffBatteryTrap;
                } else {
                    _State = __State::Off;
                    _ButtonHold = false;
                }
                break;
            
            case __State::OnBatteryTrap:
                _Scheduler::Wait([] { return !_Wired::Wired() || _BatteryTrapExit() || _ButtonHold; });
                if (!_Wired::Wired()) {
                    _State = __State::OffBatteryTrap;
                } else if (_BatteryTrapExit()) {
                    _State = __State::On;
                } else {
                    _State = __State::Off;
                    _ButtonHold = false;
                }
                break;
            }
        }
    }
    
    static bool On() {
        switch (_State) {
        case __State::Off:              return false;
        case __State::OffBatteryTrap:   return false;
        case __State::On:               return true;
        case __State::OnBatteryTrap:    return true;
        }
        Assert(false);
    }
    
    static bool BatteryTrap() {
        switch (_State) {
        case __State::Off:              return false;
        case __State::OffBatteryTrap:   return true;
        case __State::On:               return false;
        case __State::OnBatteryTrap:    return true;
        }
        Assert(false);
    }
    
    static void ButtonHold() {
        _ButtonHold = true;
    }
    
    static void CaptureNotify() {
        // Short-circuit if we're in battery trap
        // We don't want to monitor the battery while we're in battery trap, to minimize battery use
        if (BatteryTrap()) return;
        
        _CaptureCounter--; // Rollover OK since we reset _CaptureCounter in Run()
        if (!_CaptureCounter) {
            _TaskBatteryLevel::Update();
            _TaskBatteryLevel::Wait();
        }
    }
    
    static bool ISRRTC() {
        // Short-circuit if we're in battery trap
        // We don't want to monitor the battery while we're in battery trap, to minimize battery use
        if (BatteryTrap()) return false;
        
        _RTCCounter--; // Rollover OK since we reset _RTCCounter in Run()
        if (!_RTCCounter) {
            _TaskBatteryLevel::Update();
            return true;
        }
        return false;
    }
    
    // _Init(): initialize system
    //
    // Ints: disabled
    //   Rationale: GPIO::Init() and _RTC::Init() require it, and in general we don't want
    //   interrupts to fire while we configure our other subsystems
    static void _Init() {
        // Init watchdog first
        _Watchdog::Init();
        
        // Init GPIOs
        GPIO::Init<
            // Power control
            _Pin::VDD_B_EN,
            _Pin::VDD_B_1V8_IMG_SD_EN,
            _Pin::VDD_B_2V8_IMG_SD_EN,
            
