toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
            // Clock (config chosen by _Clock)
            _Clock::Pin::XIN,
            _Clock::Pin::XOUT,
            
            // SPI (config chosen by _SPI)
            _SPI::Pin::Clk,
            _SPI::Pin::DataOut,
            _SPI::Pin::DataIn,
            
            // I2C (config chosen by _I2C)
            _I2C::Pin::SCL,
            _I2C::Pin::SDA,
            
            // Motion (config chosen by _Motion)
            _Motion::Pin::Power,
            _Motion::Pin::Signal,
            
            // Battery (config chosen by _BatterySampler)
            _BatterySampler::Pin::BatChrgLvlPin,
            _BatterySampler::Pin::BatChrgLvlEn_Pin,
            
            // Button (config chosen by _Button)
            _Button::Pin,
            
            // Wired
            _Wired::Pin,
            
            // LEDs
            _Pin::LED_GREEN_,
            _Pin::LED_RED_
        
        >(Startup::ColdStart());
        
        // Init clock
        _Clock::Init();
        
//        _Pin::LED_RED_::Write(1);
//        for (;;) {
//            _Pin::LED_RED_::Write(1);
//            __delay_cycles(1000000);
//            _Pin::LED_RED_::Write(0);
//            __delay_cycles(1000000);
//        }
        
//        _Pin::LED_RED_::Write(1);
//        _Pin::LED_GREEN_::Write(1);
//        for (;;) {
//            _Pin::LED_RED_::Write(0);
//            __delay_cycles(1000000);
//            _Pin::LED_RED_::Write(1);
//            __delay_cycles(1000000);
//        }
        
//        _Pin::LED_RED_::Write(1);
//        _Pin::LED_GREEN_::Write(1);
//        for (;;) {
//            _Pin::LED_RED_::Write(0);
////            __delay_cycles(1000000);
//            _Scheduler::Delay(_Scheduler::Ms<100>);
//            _Pin::LED_RED_::Write(1);
////            __delay_cycles(1000000);
//            _Scheduler::Delay(_Scheduler::Ms<100>);
//        }
        
        // Init RTC
        // We need RTC to be unconditionally enabled for 2 reasons:
        //   - We want to track relative time (ie system uptime) even if we don't know the wall time.
        //   - RTC must be enabled to keep BAKMEM alive when sleeping. If RTC is disabled, we enter
        //     LPM4.5 when we sleep (instead of LPM3.5), and BAKMEM is lost.
        _RTC::Init();
        
        // Init LEDs by setting their default-priority / 'backstop' values to off.
        // This is necessary so that relinquishing the LEDs from I2C task causes
        // them to turn off. If we didn't have a backstop value, the LEDs would
        // remain in whatever state the I2C task set them to before relinquishing.
        _LEDGreen_.set(_LEDPriority::Default, 1);
        _LEDRed_.set(_LEDPriority::Default, 1);
        
        // Restore our saved power state
        _State = (__State)_TaskPowerStateSaved;
        
        // Start tasks
        _Scheduler::Start<_TaskBatteryLevel, _TaskI2C, _TaskMotion, _TaskButton>();
        
        // Trigger a battery level update when first starting
        _TaskBatteryLevel::Update();
        _TaskBatteryLevel::Wait();
    }
    
    static void _StateChanged() {
        _TaskPowerStateSaved = std::to_underlying((__State)_State);
    }
    
    static bool _BatteryTrapEnter() {
        return _TaskBatteryLevel::Get() <= _BatteryTrapLevelEnter;
    }
    
    static bool _BatteryTrapExit() {
        return _TaskBatteryLevel::Get() >= _BatteryTrapLevelExit;
    }
    
    static void _LEDFlickerEnabledUpdate() {
//        _LEDFlickerEnabled = _BatteryTrap && !_Wired && !_LEDFlashing;
    }
    
    static void _LEDFlickerEnabledChanged() {
        _LEDFlicker::Enabled(_LEDFlickerEnabled);
    }
    
    static void _LEDFlash(OutputPriority& led) {
        _LEDFlashing = true;
        
        // Turn off both LEDs
        _LEDGreen_.set(_LEDPriority::Power, 1);
        _LEDRed_.set(_LEDPriority::Power, 1);
        _Scheduler::Delay(_Scheduler::Ms<100>);
        
        // Flash red LED to signal that we're turning off
        for (int i=0; i<5; i++) {
            led.set(_LEDPriority::Power, 0);
            _Scheduler::Delay(_Scheduler::Ms<50>);
            led.set(_LEDPriority::Power, 1);
            _Scheduler::Delay(_Scheduler::Ms<50>);
        }
        
        // Relinquish both LEDs
        _LEDGreen_.set(_LEDPriority::Power, std::nullopt);
        _LEDRed_.set(_LEDPriority::Power, std::nullopt);
        _Scheduler::Delay(_Scheduler::Ms<100>);
        
        _LEDFlashing = false;
    }
    
    static void Sleep() {
        // Put ourself to sleep until an interrupt occurs
        
        // Enable/disable SysTick depending on whether we have tasks that are waiting for a deadline to pass.
        // We do this to prevent ourself from waking up unnecessarily, saving power.
        const bool systickEnabled = _Scheduler::TickRequired();
        _SysTick::Enabled(systickEnabled);
        
        // We consider the sleep 'extended' if SysTick isn't needed during the sleep
        const bool extendedSleep = !systickEnabled;
        _Clock::Sleep(extendedSleep);
        
        // Unconditionally enable SysTick while we're awake
        _SysTick::Enabled(true);
    }
    
    enum class __State : uint8_t {
        Off,
        OffBatteryTrap,
        On,
        OnBatteryTrap,
    };
    
    static constexpr uint16_t _SampleIntervalRTCDays = 4;
    static constexpr uint16_t _SampleIntervalRTC     = (_SampleIntervalRTCDays * Time::Day) / _RTC::InterruptIntervalTicks;
    static constexpr uint16_t _SampleIntervalCapture = 512;
    
    static constexpr uint8_t _BatteryTrapPercentEnter = 2;
    static constexpr uint8_t _BatteryTrapPercentExit  = 10;
    
    static constexpr MSP::BatteryLevel _BatteryTrapLevelEnter
        = MSP::BatteryLevelMin + ((((uint32_t)MSP::BatteryLevelMax-MSP::BatteryLevelMin)*_BatteryTrapPercentEnter)/100);
    static constexpr MSP::BatteryLevel _BatteryTrapLevelExit
        = MSP::BatteryLevelMin + ((((uint32_t)MSP::BatteryLevelMax-MSP::BatteryLevelMin)*_BatteryTrapPercentExit)/100);
    
