toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
    static_assert(_SampleIntervalRTC     == 168);  // Debug
    static_assert(_BatteryTrapLevelEnter == 1311); // Debug
    static_assert(_BatteryTrapLevelExit  == 6554); // Debug
    
    static inline uint16_t _RTCCounter = 0;
    static inline uint16_t _CaptureCounter = 0;
    
    static inline bool _ButtonHold = false;
    
    static inline T_Property<__State,_StateChanged,_EventsEnabledUpdate> _State = __State::Off;
    
    // _LEDFlashing: whether we're currently flashing the LEDs manually
    static inline T_Property<bool,_LEDFlickerEnabledUpdate> _LEDFlashing;
    
    // _LEDFlickerEnabled: whether the LED should flicker periodically (due to battery trap)
    static inline T_Property<bool,_LEDFlickerEnabledChanged> _LEDFlickerEnabled;
    
    static constexpr uint32_t _FlickerPeriodMs      = 5000;
    static constexpr uint32_t _FlickerOnDurationMs  = 20;
    using _LEDFlicker = T_LEDFlicker<_Pin::LED_GREEN_, _ACLKFreqHz, _FlickerPeriodMs, _FlickerOnDurationMs>;
    
    // Task stack
    static constexpr auto& Stack = _TaskPowerStack;
};

// MARK: - _TaskI2C

struct _TaskI2C {
    static void Run() {
        for (;;) {
            // Wait until STM is up (ie we're plugged in)
            _Scheduler::Wait([] { return _Wired::Wired(); });
            
            _I2C::Init();
            
            for (;;) {
                // Wait for a command
                MSP::Cmd cmd;
                bool ok = _I2C::Recv(cmd);
                if (!ok) break;
                
                // Handle command
                const MSP::Resp resp = _CmdHandle(cmd);
                
                // Send response
                ok = _I2C::Send(resp);
                if (!ok) break;
            }
            
            // Cleanup
            
            // Relinquish LEDs, which may have been set by _CmdHandle()
            _LEDRed_.set(_LEDPriority::I2C, std::nullopt);
            _LEDGreen_.set(_LEDPriority::I2C, std::nullopt);
            
            // Reset state
            _HostModeState = {};
        }
    }
    
    static void WiredChanged() {
        // If we became unwired, restart our I2C state machine
        if (!_Wired::Wired()) _I2C::Abort();
    }
    
    static MSP::Resp _CmdHandle(const MSP::Cmd& cmd) {
        using namespace MSP;
        switch (cmd.op) {
        case Cmd::Op::None:
            return MSP::Resp{ .ok = false };
        
        case Cmd::Op::StateRead: {
            const size_t off = cmd.arg.StateRead.off;
            if (off > sizeof(::_State)) return MSP::Resp{ .ok = false };
            const size_t rem = sizeof(::_State)-off;
            const size_t len = std::min(rem, sizeof(MSP::Resp::arg.StateRead.data));
            MSP::Resp resp = { .ok = true };
            memcpy(resp.arg.StateRead.data, (uint8_t*)&::_State+off, len);
            return resp;
        }
        
        case Cmd::Op::StateWrite: {
            const size_t off = cmd.arg.StateWrite.off;
            if (off > sizeof(::_State)) return MSP::Resp{ .ok = false };
            FRAMWriteEn writeEn; // Enable FRAM writing
            const size_t rem = sizeof(::_State)-off;
            const size_t len = std::min(rem, sizeof(MSP::Cmd::arg.StateWrite.data));
            memcpy((uint8_t*)&::_State+off, cmd.arg.StateWrite.data, len);
            return MSP::Resp{ .ok = true };
        }
        
        case Cmd::Op::LEDSet:
            _LEDRed_.set(_LEDPriority::I2C, !cmd.arg.LEDSet.red);
            _LEDGreen_.set(_LEDPriority::I2C, !cmd.arg.LEDSet.green);
            return MSP::Resp{ .ok = true };
        
        case Cmd::Op::TimeGet:
            return MSP::Resp{
                .ok = true,
                .arg = { .TimeGet = { .state = _RTC::TimeState() } },
            };
        
        case Cmd::Op::TimeSet:
            // Only allow setting the time while we're in host mode
            // and therefore _TaskEvent isn't running
            if (!_HostModeState.en) return MSP::Resp{ .ok = false };
            _RTC::Init(&cmd.arg.TimeSet.state);
            return MSP::Resp{ .ok = true };
        
        case Cmd::Op::TimeAdjust:
            // Only allow setting the time while we're in host mode
            // and therefore _TaskEvent isn't running
            if (!_HostModeState.en) return MSP::Resp{ .ok = false };
            _RTC::Adjust(cmd.arg.TimeAdjust.adjustment);
            return MSP::Resp{ .ok = true };
        
        case Cmd::Op::HostModeSet:
            if (cmd.arg.HostModeSet.en) {
                _HostModeState.en = true;
            } else {
                // Clear entire _HostModeState when exiting host mode
                _HostModeState = {};
            }
            return MSP::Resp{ .ok = true };
        
        case Cmd::Op::VDDIMGSDSet:
            if (!_HostModeState.en) return MSP::Resp{ .ok = false };
            _HostModeState.vddImgSd = cmd.arg.VDDIMGSDSet.en;
            return MSP::Resp{ .ok = true };
        
        case Cmd::Op::BatteryLevelGet: {
            _TaskBatteryLevel::Update();
            _TaskBatteryLevel::Wait();
            return MSP::Resp{
                .ok = true,
                .arg = { .BatteryLevelGet = { .level = _TaskBatteryLevel::Get() } },
            };
        }}
        
        return MSP::Resp{ .ok = false };
    }
    
    static bool HostModeEnabled() {
        return _HostModeState.en;
    }
    
    static inline struct {
        T_Property<bool,_EventsEnabledUpdate> en;
        _VDDIMGSDEnabled::Assertion vddImgSd;
    } _HostModeState;
    
    // Task stack
    SchedulerStack(".stack._TaskI2C")
    static inline uint8_t Stack[256];
};

// MARK: - _TaskSD

//static void debugSignal() {
//    _Pin::DEBUG_OUT::Init();
//    for (;;) {
////    for (int i=0; i<10; i++) {
//        _Pin::DEBUG_OUT::Write(0);
//        for (volatile int i=0; i<10000; i++);
//        _Pin::DEBUG_OUT::Write(1);
//        for (volatile int i=0; i<10000; i++);
//    }
//}

struct _TaskSD {
    static void Reset() {
        // Reset our state
        _State = {};
    }
    
    static void CardReset() {
        Wait();
        _Scheduler::Start<_TaskSD>([] { _CardReset(); });
    }
    
